Repository: whosm1ke/HomeTaskScheduler
Catalog: HomeTaskScheduler.Application/Resources/CommentResources.*.resx
Languages: uk

# CommentPayloadLengthLimit2000
source: Comment must be less than 2000 characters. You entered {0} characters
uk: Коментар не повинен перевищувати 2000 символів. Ви ввели {0} символів.

source: Comment is required
uk: Коментар обов'язковй

# InvalidCommentTargetType
source: Comment Target Type is invalid
uk: Ціль коментаря не є дійсною

# CommentTargeTypeIsRequired
source: Comment Target Type is required
uk: Ціль коментаря обов'язкова

# NoTaskByTargetId
source: There was no such task by provided target id
uk: За наданим цільовим ідентифікатором такого завдання не було.

# NoCourseByTargetId
source: There was no such course by provided target id
uk: За вказаним цільовим ідентифікатором такого подання не було.

source: Target Id is required
uk: Цільовий ідентифікатор обов'язковий

source: User Id is required
uk: Потрібен ідентифікатор користувача

# UserNotExists
source: User does not exists by provided Id
uk: Користувач не існує за наданим ідентифікатором

# CommentDoesNotExist
source: Comment does not exists by provided Id
uk: Коментар не існує за вказаним ідентифікатором

source: Comment Id is required
uk: Ідентифікатор коментаря обов'язковий
