Repository: whosm1ke/HomeTaskScheduler
Catalog: HomeTaskScheduler.Application/Resources/SubmissionResources.*.resx
Languages: uk

# GradeBetween1And100
source: Grade must be between 1 and 100.
uk: Оцінка має бути від 1 до 100.

# TaskIdIsRequired
source: Invalid Task Configuration ID.
uk: Неправильний ідентифікатор завдання.

source: Invalid submission status.
uk: Неправильний статус подання.

source: Invalid submission type.
uk: Неправильний тип подання.

source: Student Id is required.
uk: Студентський айді обов'язковий.

# StudentDoestNotFound
source: Student does not exists by provided Id
uk: Студент не існує за вказаним ідентифікатором

# TaskNotFound
source: Task was not found bt provided id
uk: Завдання не знайдено за вказаним ідентифікатором

# AnswerCanNotBeEmpty
source: Provide answer please
uk: Надайте відповідь, будь ласка

# InvalidAnswerIndex
source: Invalid index of answer. Question : {0}
uk: Неправильний індекс відповіді. Питання : {0}

# InvalidQuestionIndex
source: Invalid index of question. Questions length: {0}, bad index: {0}
uk: Неправильний індекс питання. Довжина питання: {0}, поганий індекс: {0}

source: Submission Id is required
uk: Потрібен ідентифікатор подання

# SubmissionNotFound
source: Submission does not exists by provided Id
uk: Подання не існує за вказаним ідентифікатором
