Repository: whosm1ke/HomeTaskScheduler
Catalog: HomeTaskScheduler.Application/Resources/TaskResources.*.resx
Languages: uk

# CourseIdsIsRequired
source: At least one course Id is required
uk: Потрібен принаймні один ідентифікатор курсу

# CourseIdsNotNull
source: Course Id's can not be null
uk: Ідентифікатор курсу не може бути нульовим

source: Invalid Task Type
uk: Неправильний тип завдання

# StudentIdsIsRequired
source: At least one student Id is required
uk: Потрібен принаймні один студентський айді

# MaxMArkBetween1And100
source: Max mark must be between 1 and 100.
uk: Максимальна оцінка має бути від 1 до 100.

# StudentIdsNotNull
source: Student Id's can not be null
uk: Ідентифікатори студента не може бути нульовим

# TaskInstructionsNoLongerThan2000
source: Task instructions must be less than 2000 characters. You entered {0} characters.
uk: Інструкції до завдання не повинні перевищувати 2000 символів. Ви ввели {0} символів.

source: Task title is required.
uk: Назва завдання обов'язкова.

# TaskTitleNoLongerThan200
source: Task title must be less than 200 characters. You entered {0} characters.
uk: Назва завдання не повинна перевищувати 200 символів. Ви ввели {0} символів.

source: Invalid Answer Unit
uk: Неправильна одиниця відповіді

source: Answer Unit is required
uk: Потрібна одиниця відповідей

# QuestinAnswerIsRequired
source: Provide at least one question and answer
uk: Надайте принаймні одне запитання та відповідь

# QuestionIsRequired
source: Provide a question please
uk: Поставте запитання, будь ласка

# QuestionLengthLimit200
source: Question must be less than 200 characters. You entered {0} characters.
uk: Питання не повинно перевищувати 200 символів. Ви ввели {0} символів.

# TaskIdIsRequired
source: Task Configuration Id is required
uk: Потрібен ідентифікатор конфігурації завдання

# TaskDoesNotExists
source: Task does not exists by provided Id
uk: Завдання не існує за вказаним ідентифікатором
